// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 6: Проверка на простое число: 
// N = 13 -> "Это простое число"
// N = 12 -> “Это не простое число”
