// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
Задача 2: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
45 -> 101101
3  -> 11
2  -> 10
