// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

//  Задача 1: Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа. 
// Не использовать строки для расчета.
// 456 -> 5
// 782 -> 8
// 918 -> 1

