// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
Задача 4: Напишите программу, которая будет создавать копию заданного массива с помощью поэлементного копирования.
