// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
//  Задача 3: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет. 
// Не использовать строки для расчета.
// 645 -> 5
// 78 -> третьей цифры нет
// 326792 -> 6
