// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
Задача 1: Напишите программу замены элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
[-4, -8, 8, 2] -> [4, 8, -8, -2] 