// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
Задача 2: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, 
стоящих на нечётных позициях.
[3, 7, 23, 12] -> 26
[-4, -6, 4, 6] -> 0
