// Lesson 3
// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 6*: Напишите программу, которая генерирует последовательность случайных чисел до тех пор, 
// пока не сгенерирует кратное число введенному в начале.